# Python and databases

### Use sqlalchemy for ORM and/or abstraction layer over any database system
[simple introduction](https://leportella.com/sqlalchemy-tutorial.html)

Check mysql server running in container with: 
1. `docker ps` to see the runningn contianers
2. `docker exec -it mysql_notebooks bash` to get into the container
3. `mysql -u root -proot` to get into sql prompt
4. `show databases; use db; show tables;` to see databases and to see tables inside the db database.

In [3]:
import sqlalchemy as s_a

# for password with special chars we need url encoding: import urllib.parse; urllib.parse.quote_plus("somestrangepasswordkx%jj5/g"); # will return the encoded password to put in the connectionsstring

# dialect+driver://username:password@host:port/database
SQLALCHEMY_DATABASE_URL = "mysql+mysqlconnector://root:root@db/db"
engine = s_a.create_engine(SQLALCHEMY_DATABASE_URL)
connection = engine.connect()
query = 'select * from pythondemo'
resultProxy= connection.execute(query)
resultSet = resultProxy.fetchall()
print(type(resultProxy))
print(type(resultSet))
resultSet[:]

<class 'sqlalchemy.engine.result.ResultProxy'>
<class 'list'>

[(1, 'Henny', 'Petersen', datetime.datetime(2002, 2, 2, 0, 0), datetime.datetime(2002, 2, 3, 23, 0), 5000.0),
 (2, 'Hassan', 'Hassani', datetime.datetime(2018, 7, 7, 0, 0), None, 6900.0),
 (3, 'Hanne', 'Hansen', datetime.datetime(2002, 4, 3, 0, 0), None, 12243.04),
 (4, 'Jesper', 'FÃ¥rekylling', datetime.datetime(2002, 4, 3, 0, 0), datetime.datetime(2018, 7, 6, 22, 0), 4000.0),
 (5, 'Ulrik', 'Volborg', datetime.datetime(2003, 3, 3, 0, 0), datetime.datetime(2005, 8, 20, 0, 0), 21000.0),
 (6, 'Ulla', 'Willman', datetime.datetime(2001, 5, 4, 0, 0), datetime.datetime(2005, 12, 24, 0, 0), 32000.0),
 (7, 'Ulfred', 'Valberg', datetime.datetime(2001, 1, 4, 0, 0), datetime.datetime(2006, 10, 30, 0, 0), 43000.0),
 (8, 'Ulrik', 'Volborg', datetime.datetime(2003, 3, 3, 0, 0), datetime.datetime(2005, 8, 20, 0, 0), 21000.0),
 (9, 'Ulla', 'Willman', datetime.datetime(2001, 5, 4, 0, 0), datetime.datetime(2005, 12, 24, 0, 0), 32000.0),
 (10, 'Ulfred', 'Vålberg', datetime.datetime(2001, 1, 4, 0, 0), datetime.datetime(2006, 10, 30, 0, 0), 43000.0),
 (11, 'Ulrik', 'Volborg', datetime.datetime(2003, 3, 3, 0, 0), datetime.datetime(2005, 8, 20, 0, 0), 21000.0),
 (12, 'Ulla', 'Willman', datetime.datetime(2001, 5, 4, 0, 0), datetime.datetime(2005, 12, 24, 0, 0), 32000.0),
 (13, 'Ulfred', 'Vålberg', datetime.datetime(2001, 1, 4, 0, 0), datetime.datetime(2006, 10, 30, 0, 0), 43000.0)]

### A more low level approach 
Without sqlalchemy we just create a database connection and run our queries.

In [7]:
import mysql.connector as mysql

## connecting to the database using 'connect()' method
db = mysql.connect(
    # connect to the mysql server running in container with service name: db. CAUTION data here are not persisted past container lifespan
    host = "db", # would be localhost if not running in docker
    user = "root",
    passwd = "root",
    db = "db"
    #,charset='latin1'
    #,collation='latin1_danish_ci'
)
print(db)
#db.set_charset_collation('utf8')

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f540e9ae750>

In [8]:
cur = db.cursor()
query = 'select * from ex1'
cur.execute(query)
print('TABLE COLUMNS: ',cur.column_names,'\n')

myresult = cur.fetchall()

for x in myresult:
    print(x)

TABLE COLUMNS:  ('id', 'customer_name', 'customer_address', 'account', 'joined')

(1, 'Freddy M', 'Hallway 22, 34322 moral county', 1000.0, datetime.datetime(2002, 2, 3, 23, 0))
(2, 'Janice F', 'Hallway 24, 34322 moral county', 2000.0, datetime.datetime(2001, 2, 4, 23, 0))
(3, 'Carla Q', 'Hallway 26, 34322 moral county', 4000.0, datetime.datetime(2000, 2, 5, 23, 0))
(4, 'Freddy MÃ¥lÃ¸v', 'Hallway 22, 34322 moral county', 1000.0, datetime.datetime(2002, 2, 3, 23, 0))

## 01 Class exercise Select
1. Use the ex1 table on the mysql_notebooks server
2. Select only those customers with less than `$3000` on the account

In [7]:
# insert, update, delete
from decimal import Decimal
from datetime import datetime, date, timedelta

# Connect with the MySQL Server



## connecting to the database using 'connect()' method
cnx = mysql.connect(host = "db", user = "root", passwd = "root", db = "db")
# cursor = cnx.cursor()

curA = cnx.cursor()
curB = cnx.cursor()

# Query to get employees who joined in a period defined by two dates
query = ("SELECT id, salary FROM pythondemo WHERE enddate IS NULL")

# Select the employees getting a raise (all that are still employed)
curA.execute(query)
result =curA.fetchall()
# Iterate through the result of curA
print(result)

    
#curA.fetchall()
cnx.commit()
# Commit the changes

[(2, 6000.0), (3, 8050.0)]

In [10]:
# insert, update, delete
from decimal import Decimal
from datetime import datetime, date, timedelta

# Connect with the MySQL Server
import mysql.connector as mysql

## connecting to the database using 'connect()' method
cnx = mysql.connect(host = "db", user = "root", passwd = "root", db = "db")
# cursor = cnx.cursor()

cursor = cnx.cursor(prepared=True)

# update the employees getting a 15% raise (all that are still employed and with a salary larger than ?)
update_query = """UPDATE pythondemo SET salary = salary * 1.15
  WHERE salary > %s AND enddate IS NULL"""

cursor.execute(update_query,(7000,)) # execute takes a tuple. Trailing comma is necessary to make it a sequence
cnx.commit()

cursor.close()
cnx.close()

In [5]:
import mysql.connector as mysql
cnx = mysql.connect(host = "db", user = "root", passwd = "root", db = "db")
cursor = cnx.cursor(prepared=True)
insert_query = 'insert into person (name) values(%s)'
cursor.execute(insert_query,('XXXXXXXXXX',))
cnx.commit()
cursor.close()
cnx.close()

## 02 Exercise
First create a mysql table from the mysql prompt. Then create a function that can take a dict with same keys as the column names from the sql table and a table name and persist all values of the dict into the table columns corresponding to the dict keys.

Hint: https://dev.mysql.com/doc/connector-python/en/connector-python-example-cursor-transaction.html

In [12]:
# dataframe to table
import pandas as pd 
from sqlalchemy import create_engine #sqlalchemy helped convert strings to dates seamlessly

#cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test') 
con_str = "mysql+mysqlconnector://root:root@db/db"
engine = create_engine(con_str)
#connection = engine.raw_connection()
df = pd.DataFrame({'firstname' : ['Ulrik', 'Ulla', 'Ulfred'],
                  'lastname':['Volborg','Willman','Vålberg'],
                  'startdate':['2003-03-03','2001-05-04','2001-01-04'],
                  'enddate':['2005-08-20','2005-12-24','2006-10-30'],
                  'salary':['21000', '32000', '43000']})
df = df.applymap(str)
df.to_sql('pythondemo',con=engine, if_exists='append', index = False)
df

  firstname lastname   startdate     enddate salary
0     Ulrik  Volborg  2003-03-03  2005-08-20  21000
1      Ulla  Willman  2001-05-04  2005-12-24  32000
2    Ulfred  Vålberg  2001-01-04  2006-10-30  43000

## 03 exercise
create a pandas dataframe from below csv and turn it into a mysql table called: 'cars'

```csv
make,model,year,price
vw,up,2018,123000
audi,a6,2011,85000
citroen,c3,2019,143000
```